# Introducción a Pandas

## ¿Qué es Pandas?

Pandas es una biblioteca de Python utilizada para la manipulación y análisis de datos. Ofrece estructuras de datos y herramientas de alto rendimiento diseñadas para hacer que el trabajo con datos estructurados (tablas, series temporales, etc.) sea fácil y eficiente. Pandas es especialmente útil para trabajar con datos tabulares, como los que se encuentran en hojas de cálculo o bases de datos.

### Características principales de Pandas:

- **Series y DataFrames:** Estructuras de datos fundamentales que permiten almacenar y manipular datos de forma eficiente.
- **Indexación poderosa:** Métodos de selección y filtrado avanzados.
- **Operaciones de limpieza y transformación de datos:** Facilita la manipulación de datos faltantes, duplicados, y más.
- **Soporte para múltiples formatos de datos:** Incluye funcionalidades para leer y escribir archivos CSV, Excel, bases de datos SQL, y más.

## Instalación de Pandas

Para comenzar a usar Pandas, primero necesitas instalarlo en tu sistema. A continuación, te mostramos cómo hacerlo en diferentes sistemas operativos:

## Instalación 

Para instalar Pandas en Windows, MacOS o Linux puedes usar el administrador de paquetes `pip` en tu terminal o símbolo del sistema:

```bash
pip install pandas

## Creación de un DataFrame a partir de un Diccionario

En Pandas, un DataFrame es una estructura de datos bidimensional, similar a una tabla en una base de datos o una hoja de cálculo de Excel. Uno de los métodos más comunes para crear un DataFrame es utilizando un diccionario, donde las claves corresponden a los nombres de las columnas y los valores son listas que representan los datos de cada columna.

### Ejemplo: Creación de un DataFrame

A continuación, te muestro cómo crear un DataFrame a partir de un diccionario:

In [1]:
import pandas as pd

# Crear un diccionario con datos
datos = {
    'Nombre': ['Ana', 'Carlos', 'Laura', 'Miguel'],
    'Edad': [23, 30, 22, 35],
    'Ciudad': ['Madrid', 'Barcelona', 'Sevilla', 'Bilbao']
}

# Crear un DataFrame a partir del diccionario
df = pd.DataFrame(datos)

# Mostrar el DataFrame
df

   Nombre  Edad     Ciudad
0     Ana    23     Madrid
1  Carlos    30  Barcelona
2   Laura    22    Sevilla
3  Miguel    35     Bilbao

# Cargar base de datos csv

Cargando a python bases de datos de archivos csv(Comma-Separated Values) es un formato de archivo simple y ampliamente utilizado para almacenar datos tabulares. En un archivo CSV, cada línea representa un registro, y los valores de cada columna dentro del registro están separados por comas.

# Primer método uso de github

In [10]:
import pandas as pd
url='https://raw.githubusercontent.com/jarsmp37/introds/main/Churn_Bank.csv'
df=pd.read_csv(url)
df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1.0,15634602.0,Hargrave,619,France,Female,NaN,2,0.0,1.0,1,1,101348.88,1,1,2,DIAMOND,464
1,2.0,15647311.0,Hill,608,Spain,Female,41.0,1,83807.86,1.0,0,1,112542.58,0,1,3,DIAMOND,456
2,3.0,15619304.0,Onio,502,France,Female,42.0,8,159660.8,3.0,1,0,113931.57,NaN,1,3,DIAMOND,377
3,4.0,15701354.0,Boni,699,France,Female,39.0,1,0.0,2.0,0,0,93826.63,0,invalid_value,5,GOLD,350
4,5.0,15737888.0,Mitchell,850,Spain,Female,NaN,2,125510.82,1.0,1,1,invalid_value,0,0,5,GOLD,425
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12200,7026.0,15711446.0,Sinclair,569,Spain,Female,51.0,3,0.0,3.0,1,0,75084.96,1,1,2,SILVER,NaN
12201,1272.0,15793854.0,Ahmed,723,France,Male,42.0,2,99095.73,1.0,1,1,17512.53,0,0,3,DIAMOND,505
12202,4942.0,15715047.0,Joshua,640,invalid_value,Male,43.0,9,172478.15,1.0,1,0,191084.4,1,1,4,DIAMOND,844
12203,8299.0,15605534.0,Turnbull,644,Germany,Female,51.0,4,95560.04,1.0,0,0,72628.84,1,1,1,PLATINUM,672
12204,1689.0,15804610.0,Valdez,601,France,Female,41.0,1,0.0,2.0,0,1,160607.06,0,0,4,SILVER,856

Cargar de manera manual en VSC

In [12]:
import pandas as pd
df2=pd.read_csv('Churn_Bank.csv')
df2

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Complain,Satisfaction Score,Card Type,Point Earned
0,1.0,15634602.0,Hargrave,619,France,Female,NaN,2,0.0,1.0,1,1,101348.88,1,1,2,DIAMOND,464
1,2.0,15647311.0,Hill,608,Spain,Female,41.0,1,83807.86,1.0,0,1,112542.58,0,1,3,DIAMOND,456
2,3.0,15619304.0,Onio,502,France,Female,42.0,8,159660.8,3.0,1,0,113931.57,NaN,1,3,DIAMOND,377
3,4.0,15701354.0,Boni,699,France,Female,39.0,1,0.0,2.0,0,0,93826.63,0,invalid_value,5,GOLD,350
4,5.0,15737888.0,Mitchell,850,Spain,Female,NaN,2,125510.82,1.0,1,1,invalid_value,0,0,5,GOLD,425
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12200,7026.0,15711446.0,Sinclair,569,Spain,Female,51.0,3,0.0,3.0,1,0,75084.96,1,1,2,SILVER,NaN
12201,1272.0,15793854.0,Ahmed,723,France,Male,42.0,2,99095.73,1.0,1,1,17512.53,0,0,3,DIAMOND,505
12202,4942.0,15715047.0,Joshua,640,invalid_value,Male,43.0,9,172478.15,1.0,1,0,191084.4,1,1,4,DIAMOND,844
12203,8299.0,15605534.0,Turnbull,644,Germany,Female,51.0,4,95560.04,1.0,0,0,72628.84,1,1,1,PLATINUM,672
12204,1689.0,15804610.0,Valdez,601,France,Female,41.0,1,0.0,2.0,0,1,160607.06,0,0,4,SILVER,856